#+TITLE:     Backlog for NakkiKone
#+AUTHOR:    Sami Airaksinen
#+EMAIL:     samiaira@gmail.com
#+DATE:      2012-12-21 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

This documentation is organizing development time todos.

* TODO install jasmine plugin
* TODO create jasmine tests for backbone code
* DONE install handlebars plugin for require-js
  CLOSED: [2013-02-21 Thu 23:06]
  :CLOCK:
  CLOCK: [2013-02-19 Tue 20:08]--[2013-02-19 Tue 22:51] =>  2:43
  CLOCK: [2013-02-21 Thu 21:08]--[2013-02-21 Thu 23:10] =>  2:02
  :END:
  :LOGBOOK:
  - State "DONE"       from "WAITING"    [2013-02-21 Thu 23:06]
  - State "STARTED"    from "STARTED"    [2013-02-19 Tue 22:27]
  - State "STARTED"    from "STARTED"    [2013-02-19 Tue 20:08]
  - State "STARTED"    from "TODO"       [2013-02-12 Tue 20:46]
  :END:

  - [X] add libraries
  - [X] change templates
  - [X] debug changes

** notes							       :note:
   - handlebars template helpers silently fails
   - hbs compiles templates to javasript, is it needed to filter static html as well?
* DONE update requirejs
  CLOSED: [2013-02-24 Sun 19:45]
  :LOGBOOK:
  - State "DONE"       from "TODO"       [2013-02-24 Sun 19:45]
  :END:
  - currently comes from gem is 2.0.0 (0.9.0)
  - needs only shim-configuration for jquery, bb and underscore.

** notes
   - updated gem and handlebars plugin 
* DONE update backbone
  CLOSED: [2013-02-24 Sun 19:45]
  :CLOCK:
  CLOCK: [2013-02-24 Sun 17:41]--[2013-02-24 Sun 19:45] =>  2:04
  CLOCK: [2013-02-24 Sun 16:46]--[2013-02-24 Sun 16:51] =>  0:05
  :END:
  :LOGBOOK:
  - State "DONE"       from "WAITING"    [2013-02-24 Sun 19:45]
  - State "STARTED"    from "WAITING"    [2013-02-24 Sun 17:41]
  - State "STARTED"    from "TODO"       [2013-02-24 Sun 16:46]
  :END:
  - done in the same time as requirejs update

  - [X] creating submodules to repos (bb and underscore)
  - [X] linking and checking that no major breakdowns

** notes
   - be careful with dependent library versions
   - see ref https://github.com/SlexAxton/require-handlebars-plugin/issues/80 

* TODO backend stuff [1/6]
** DONE [#A] serialized user model don't have all attributes!!
   CLOSED: [2013-03-02 Sat 19:06]
   :CLOCK:
   CLOCK: [2013-03-02 Sat 13:57]--[2013-03-02 Sat 19:06] =>  5:09
   CLOCK: [2013-03-02 Sat 13:43]--[2013-03-02 Sat 13:46] =>  0:03
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2013-03-02 Sat 19:06]
   - State "STARTED"    from "WAITING"    [2013-03-02 Sat 13:57]
   - State "STARTED"    from "TODO"       [2013-03-02 Sat 13:43]
   :END:
   
   - added activemodel serializers for each model
   - refactored js code slightly

** WAITING [#A] create model for pre- and post-building nakkis
   :CLOCK:
   CLOCK: [2013-03-05 Tue 20:16]--[2013-03-05 Tue 23:29] =>  3:13
   :END:
   :LOGBOOK:
   - State "STARTED"    from "TODO"       [2013-03-05 Tue 20:16]
   :END:
** TODO remove duplicates from parcipiants response
   :LOGBOOK:
   - State "STARTED"    from "TODO"       [2013-03-05 Tue 20:15]
   :END:
** TODO Map Record not found responses to 404 and empty bodies
   - e.g. remove stack traces
** TODO check and redefine resource url patterns if needed
** TODO document backend design and functionality
* TODO ui stuff [5/11]
** DONE [#A] selector for pre and post building
   CLOSED: [2013-03-19 Tue 21:48]
   :CLOCK:
   CLOCK: [2013-03-05 Tue 23:29]--[2013-03-06 Wed 00:30] =>  1:01
   :END:
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2013-03-19 Tue 21:48]
   - State "STARTED"    from "TODO"       [2013-03-05 Tue 23:29]
   - State "STARTED"    from "TODO"       [2013-03-05 Tue 20:15]
   :END:

   - selector, but is going to be replaced with other kind of UI
     design

** TODO [#B] fix date parsing for party
** TODO [#B] replace proper time for slot column  
** DONE [#B] redirection logic on 401 and 403 in BB
   CLOSED: [2013-03-19 Tue 22:26]
   :CLOCK:
   CLOCK: [2013-03-19 Tue 21:54]--[2013-03-19 Tue 22:25] =>  0:31
   :END:
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2013-03-19 Tue 22:26]
   - State "STARTED"    from "TODO"       [2013-03-19 Tue 21:54]
   :END:

   - also redirection when signing up
   - now all errors > 400 trigger redirection to login page.
     
** DONE hide logout button when logged out
   CLOSED: [2013-03-19 Tue 21:33]
   :CLOCK:
   CLOCK: [2013-03-19 Tue 20:50]--[2013-03-19 Tue 21:33] =>  0:43
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2013-03-19 Tue 21:33]
   - State "STARTED"    from "TODO"       [2013-03-19 Tue 20:50]
   :END:
   
   - whole navigation bar is hidden until logged in.

** DONE logout link, bb conventions
   CLOSED: [2013-03-03 Sun 21:58]
   :CLOCK:
   CLOCK: [2013-03-03 Sun 20:32]--[2013-03-03 Sun 21:39] =>  1:07
   :END:
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2013-03-03 Sun 21:58]
   - State "STARTED"    from "TODO"       [2013-03-03 Sun 20:32]
   :END:
   - created simple view that renders logout link in place when logged user has been resolved
** DONE clean up templates
   CLOSED: [2013-02-24 Sun 21:14]
   :CLOCK:
   CLOCK: [2012-12-21 Fri 20:51]--[2012-12-21 Fri 21:17] =>  0:26
   :END:
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2013-02-24 Sun 21:14]
   - State "STARTED"    from "TODO"       [2012-12-21 Fri 20:51]
   :END:
** TODO redefine route patterns
** TODO rollers for party start and end times
** TODO date picker for party start date
   remember that parties almost always are from night to dawn
** TODO improve party creation flow
   1. Title, time, (start and endtime) and description (providing template)
   2. define nakki types (columns)
   3. confirm.
   4. After which admin can modify party properties
      - nakki columns edits will destroy existing reservations?
      - time edits as well?
* TODO Usability stuff
* TODO UserManagement
** TODO Screen to administrate nakkikone users
*** TODO reset password
*** TODO remove user
*** TODO edit details
*** TODO user can itself access itself
* improvement ideas
** create error handling module
   - provides tools to notify users about backend errors
   - also part of the redirection logic could go here
** two levels of nakkis
   - special nakki assignment for organizers?
** Create separate authentication module
* Development time defects
** DONE after login and reload page, assigned user is empty
   CLOSED: [2013-02-28 Thu 22:29]
   :CLOCK:
   CLOCK: [2013-02-28 Thu 21:08]--[2013-02-28 Thu 22:29] =>  1:21
   :END:
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2013-02-28 Thu 22:29]
   - State "STARTED"    from ""           [2013-02-28 Thu 21:08]
   :END:
   - work if you do session based login in browsing root url
   - happens because login is done with ajax.get and publicscreen gets
     initalized before it sets the value to it.
*** notes
    - authentication module inits before app does
    - lazy eval of current user until public view is initialized
    - removed 'logged in' event from session cookie relogin
